# !Private homebrew tap repository
tap "iwai/tap"
cask "iwai/tap/font-ricty-diminished-nerd-font"

# cli tools
brew "fish"
brew "tmux"
brew "peco"
brew "tree"
brew "ripgrep"
brew "fzf"

brew "hub"
brew "git-secrets"

brew "anyenv"
brew "direnv"

brew "golangci/tap/golangci-lint"

# brew "zlib"
# brew "pandoc"

tap "jesseduffield/lazydocker"
brew "lazydocker"

# spacemacs
tap "d12frosted/emacs-plus"
brew "d12frosted/emacs-plus/emacs-plus"

cask "iterm2"
cask "vagrant"
#cask "virtualbox"
cask "docker"

cask "gpg-suite"
cask "google-backup-and-sync"
